# Built In Failures Site Failures Grade Region Elements Ingore Bottom Property

Source: https://www.revitapidocs.com/2026/3b3e89b6-f3cd-2d3e-928a-1d44d66156be.htm

---

| Built In Failures Site Failures Grade Region Elements Ingore Bottom Property |
| --- |

The current grading element has different elevations on bottom faces with existing element, however the cut/fill volume calculation will ignore the bottom faces differences.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId GradeRegionElementsIngoreBottom { get; }
```

```
Public Shared ReadOnly Property GradeRegionElementsIngoreBottom As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ GradeRegionElementsIngoreBottom {
	FailureDefinitionId^ get ();
}
```

```
static member GradeRegionElementsIngoreBottom : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures SiteFailures Class Autodesk.Revit.DB Namespace